/* ======================================== */
/*    程序: 1-1.c                                 */
/*    计算总分和平均分                          */
/* ======================================== */

void  main()
{
	int t1,t2,t3,t4,t5;                               /*各次的成绩 */
	int t6,t7,t8,t9,t10;
	int sum;                                     /* 总分       */
	int average;                                  /* 平均分       */

	t1 = 81; t2 = 90; t3 = 80; t4 = 59; t5 = 70;
	t6 = 85; t7 = 92; t8 = 84; t9 = 100; t10 = 78;
	sum = t1 + t2 + t3 + t4 +t5 + t6 + t7 + t8 + t9 + t10;  /* 计算总分   */
	average = sum / 10;                           /* 计算平均分  */
	printf("输出总分:%d\n",sum);                  /* 输出总分   */
	printf("输出平均:%d\n",average);               /* 输出平均分   */
}

