/* ======================================== */
/*    程序: 1-2.c                                  */
/*    计算总分和平均分                           */
/* ======================================== */

void main()
{
	int t[10] = { 81,90,80,59,70,85,92,84,100,78 };
	int sum;                            /* 总分         */
	int average;                         /* 平均分         */
	int i;

	sum = 0;                            /* 设置总分初值 */
	for ( i = 0; i < 10; i++ )
		sum += t[i];                     /* 计算总分     */
	average = sum / 10;                    /* 计算平均分     */
	printf("输出总分:%d\n",sum);           /* 输出总分     */
	printf("输出平均:%d\n",average);        /* 输出平均分     */
}

