/* ======================================== */
/*    程序: 2-1.c                                  */
/*    顺序表上元素的插入操作                     */
/* ======================================== */
#include<stdio.h>
#define MAXLEN 100       	/* MAXSIZE 要大于实际线性表的长度 */ 
typedef int elementtype;      	/*根据需要，elementtype也可以定义为其他任何类型*/
typedef struct               	/*定义线性表*/
{
	elementtype s[MAXLEN];  	/*定义线性表中元素，MAXLEN-1为线性表的最大容量*/
	int len;                  /*定义线性表的表长*/
}SqList;

/* ---------------------------------------- */
/*  元素的插入                */
/* ---------------------------------------- */
int InsertSqlist(SqList *sql,int i,elementtype x)
{ 
	int j;
	if((i<1)||(i>sql->len+1)) 	/*首先判断插入位置是否合法*/
	{
		printf("插入位置%d不合法\n",i);
		return(0);
	}
	if(sql->len>=MAXLEN-1)
	{
		printf("表已满无法插入");
		return(0);
	}
	for(j=sql->len;j>=i;j--)
		sql->s[j+1]=sql->s[j];   	/*向后移动数据，腾出要插入的空位*/
	sql->s[j+1]=x;           		/*修正插入位置为j+1，将新元素插入到s[j+1]位置*/
	(sql->len)++;            		/*表长加1*/
	return(1);               		/*插入成功，返回值为1*/
} 

/* --------------------------------------------------------------- */
/*  主程序:创建顺序表，并在指定位置插入元素   */
/* --------------------------------------------------------------- */
void main()
{
	SqList seq;
	int p,q,r;
	int i;
	printf("请输入线性表的长度：");
	scanf("%d",&r);
	seq.len =r;
	printf("请输入线性表的各元素值：\n");	
	for(i=1; i<=seq.len; i++)
		/*赋线性表各元素初值，为与前面的概念描述一致，seq.s[0]闲置不用*/
	{
		scanf("%d",&seq.s[i]);
	}
	printf("请输入要插入的位置：");
	scanf("%d",&p);
	printf("请输入要插入的元素值：");
	scanf("%d",&q);	
	InsertSqlist (&seq,p,q);                 /*调用插入元素的函数*/
	printf("插入元素后的线性表：\n");
	for(i=1; i<=seq.len; i++)
	{
		printf("%d  ",seq.s[i]);
	}
}

//程序运行结果：
//请输入线性表的长度：6（回车）
//请输入线性表的各元素值：
//1 2 3 4 5 6
//请输入要插入的位置：4（回车）
//请输入要插入的元素值：9（回车）
//插入元素后的线性表：
//1 2 3 9 4 5 6
