/* ======================================== */
/*    程序实例: 3-4.c                              */
/*    浮点数内存分配和释放                       */
/* ======================================== */
#include <stdlib.h>

int main()
{
	float *fp;                            /* 浮点指针声明     */

	fp = (float *) malloc(sizeof(float));       /* 分配浮点数内存 */
	if ( !fp )                            /* 检查指针         */
	{
		printf("记忆体配置失败! \n");
		exit(1);
	}

	*fp = 3.1415926;                      /* 设定变数值       */
	printf("圆周率: %10.8f \n",*fp);          /* 列出结果         */
	free(fp);                             /* 释回记忆体空间   */
}
//程序运行结果：
//圆周率: 3.14159250
