/* ======================================== */
/*    程序实例: 3-1.c                              */
/*    使用malloc()来分配浮点数内存                */
/* ======================================== */
#include <stdlib.h>
int main()
{
   float *fp;                            /* 浮点指标声明     */
   fp = (float *) malloc(sizeof(float));        /* 分配浮点数内存 */
   if ( !fp )                             /* 检查指针         */
   {
      printf("内存分配失败! \n");
      exit(1);
   }
   *fp = 3.1415926;                      /* 设置变量值       */
   printf("圆周率: %10.8f \n",*fp);          /* 输出结果         */
   return 0;
}

//程序运行结果：
//圆周率: 3.14159250
